Revit 2027 API
FamilyItemFactory.NewFormByCap Method
Create new Form element by cap operation (to create a single-surface form), and add it into the Autodesk Revit family document.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Form NewFormByCap(
	bool isSolid,
	ReferenceArray profile
)
Public Function NewFormByCap (
	isSolid As Boolean,
	profile As ReferenceArray
) As Form
public:
Form^ NewFormByCap(
	bool isSolid,
	ReferenceArray^ profile
)
member NewFormByCap :
        isSolid : bool *
        profile : ReferenceArray -> Form
Parameters
isSolid Boolean
Indicates if the Form is Solid or Void.
profile ReferenceArray
The profile of the newly created cap. It should consist of only one curve loop.
Return Value
Form
If creation was successful new form is returned.
See Also
Reference
FamilyItemFactory Class
Autodesk.Revit.Creation Namespace